In [1]:
import sqlite3
%load_ext sql

In [2]:
%sql sqlite:///parcy_and_posey.db

In [4]:
%%sql
SELECT orders.*
FROM orders
JOIN accounts
ON orders.account_id = accounts.id
LIMIT 10;

 * sqlite:///parcy_and_posey.db
Done.

[(1, 1001, '2015-10-06 17:31:14', 123, 22, 24, 169, 613.77, 164.78, 194.88, 973.43),
 (2, 1001, '2015-11-05 03:34:33', 190, 41, 57, 288, 948.1, 307.09, 462.84, 1718.03),
 (3, 1001, '2015-12-04 04:21:55', 85, 47, 0, 132, 424.15, 352.03, 0, 776.18),
 (4, 1001, '2016-01-02 01:18:24', 144, 32, 0, 176, 718.56, 239.68, 0, 958.24),
 (5, 1001, '2016-02-01 19:27:27', 108, 29, 28, 165, 538.92, 217.21, 227.36, 983.49),
 (6, 1001, '2016-03-02 15:29:32', 103, 24, 46, 173, 513.97, 179.76, 373.52, 1067.25),
 (7, 1001, '2016-04-01 11:20:18', 101, 33, 92, 226, 503.99, 247.17, 747.04, 1498.2),
 (8, 1001, '2016-05-01 15:55:51', 95, 47, 151, 293, 474.05, 352.03, 1226.12, 2052.2),
 (9, 1001, '2016-05-31 21:22:48', 91, 16, 22, 129, 454.09, 119.84, 178.64, 752.57),
 (10, 1001, '2016-06-30 12:32:05', 94, 46, 8, 148, 469.06, 344.54, 64.96, 878.56)]

In [6]:
%%sql
SELECT orders.standard_qty, orders.gloss_qty, 
        orders.poster_qty,  accounts.website, 
        accounts.primary_poc
FROM orders
        JOIN accounts
                ON orders.account_id = accounts.id
LIMIT 10;

 * sqlite:///parcy_and_posey.db
Done.

[(123, 22, 24, 'www.walmart.com', 'Tamara Tuma'),
 (190, 41, 57, 'www.walmart.com', 'Tamara Tuma'),
 (85, 47, 0, 'www.walmart.com', 'Tamara Tuma'),
 (144, 32, 0, 'www.walmart.com', 'Tamara Tuma'),
 (108, 29, 28, 'www.walmart.com', 'Tamara Tuma'),
 (103, 24, 46, 'www.walmart.com', 'Tamara Tuma'),
 (101, 33, 92, 'www.walmart.com', 'Tamara Tuma'),
 (95, 47, 151, 'www.walmart.com', 'Tamara Tuma'),
 (91, 16, 22, 'www.walmart.com', 'Tamara Tuma'),
 (94, 46, 8, 'www.walmart.com', 'Tamara Tuma')]

Provide a table for all the for all web_events associated with account name of `Walmart`. There should be three columns. Be sure to include the `primary_poc`, time of the event, and the `channel` for each event. Additionally, you might choose to add a fourth column to assure only `Walmart` events were chosen

In [8]:
%%sql
SELECT a.primary_poc, w.occurred_at, w.channel, a.name
FROM web_events w
    JOIN accounts a
        ON w.account_id = a.id
    WHERE a.name = 'Walmart'
LIMIT 10;

 * sqlite:///parcy_and_posey.db
Done.

[('Tamara Tuma', '2015-10-06 17:13:58', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-11-05 03:08:26', 'direct', 'Walmart'),
 ('Tamara Tuma', '2015-12-04 03:57:24', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-01-02 00:55:03', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-02-01 19:02:33', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-03-02 15:15:22', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-04-01 10:58:55', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-05-01 15:26:44', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-05-31 20:53:47', 'direct', 'Walmart'),
 ('Tamara Tuma', '2016-06-30 12:09:45', 'direct', 'Walmart')]

Provide a table that provides the region for each sales_rep along with their associated accounts. Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.

In [10]:
%%sql
SELECT r.name region, s.name rep, a.name account
FROM sales_reps s
    JOIN region r
        ON s.region_id = r.id
    JOIN accounts a
        ON a.sales_rep_id = s.id
ORDER BY a.name
LIMIT 10;

 * sqlite:///parcy_and_posey.db
Done.

[('Northeast', 'Sibyl Lauria', '3M'),
 ('Southeast', 'Earlie Schleusner', 'ADP'),
 ('Southeast', 'Moon Torian', 'AECOM'),
 ('Southeast', 'Calvin Ollison', 'AES'),
 ('Northeast', 'Elba Felder', 'AIG'),
 ('Northeast', 'Necole Victory', 'AT&T'),
 ('Midwest', 'Julie Starr', 'AbbVie'),
 ('Midwest', 'Chau Rowles', 'Abbott Laboratories'),
 ('West', 'Marquetta Laycock', 'Advance Auto Parts'),
 ('Northeast', 'Renetta Carew', 'Aetna')]

Provide the name for each region for every order, as well as the account name and the unit price they paid (total_amt_usd/total) for the order. Your final table should have 3 columns: region name, account name, and unit price. A few accounts have 0 for total, so I divided by (total + 0.01) to assure not dividing by zero.

In [12]:
%%sql
SELECT r.name region, a.name account, 
    o.total_amt_usd/(o.total + 0.01) unit_price
FROM region r
    JOIN sales_reps s
        ON s.region_id = r.id
    JOIN accounts a
        ON a.sales_rep_id = s.id
    JOIN orders o
        ON o.account_id = a.id
LIMIT 10;

 * sqlite:///parcy_and_posey.db
Done.

[('Northeast', 'Walmart', 5.759600023667239),
 ('Northeast', 'Walmart', 5.965174820318739),
 ('Northeast', 'Walmart', 5.879706082872509),
 ('Northeast', 'Walmart', 5.44423612294756),
 ('Northeast', 'Walmart', 5.960184231258712),
 ('Northeast', 'Walmart', 6.1687185711808565),
 ('Northeast', 'Walmart', 6.628910225211274),
 ('Northeast', 'Walmart', 7.003856523668134),
 ('Northeast', 'Walmart', 5.833423765599567),
 ('Northeast', 'Walmart', 5.935815147625161)]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql